**`teams/delius-core/mis_windows_server`** terragrunt plan on `push` event [#175](${url})

```
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Reading...
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Reading...
module.imagebuilder.data.terraform_remote_state.imagebuilder_mp: Read complete after 1s
module.imagebuilder.data.terraform_remote_state.core_shared_services_production: Read complete after 1s
module.imagebuilder.data.aws_secretsmanager_secret.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Reading...
module.imagebuilder.data.aws_secretsmanager_secret_version.environment_management: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Reading...
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Reading...
module.imagebuilder.data.aws_caller_identity.current: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Reading...
module.imagebuilder.data.aws_kms_key.hmpps_ebs_encryption_cmk: Read complete after 0s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["ec2launch-v2-windows"]: Read complete after 1s [id=<REDACTED>]
module.imagebuilder.data.aws_imagebuilder_component.this["amazon-cloudwatch-agent-windows"]: Read complete after 1s [id=<REDACTED>]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # module.imagebuilder.aws_imagebuilder_component.this["add_net_framework_features.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: add_net_framework_features
            description: Component to add net-framework-features windows feature
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.2.0
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: AddNetFrameworkFeatures
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          add-windowsfeature net-framework-features -Source D:\sources\sxs\
        EOT
      + date_created = (known after apply)
      + description  = "Component to add net-framework-features windows feature"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "add_net_framework_features"
      + owner        = (known after apply)
      + platform     = "Windows"
      + skip_destroy = false
      + tags         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all     = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + type         = (known after apply)
      + version      = "0.2.0"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_mis_configure_cloudwatch_agent.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: delius_iaps_configure_cloudwatch_agent
            description: Configures the cloudwatch agent
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: CreateCloudWatchAgentConfigFile
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\aws\cloudwatch\cloudwatch.config.json
                        overwrite: true
                        content: |
                          {
                            "logs": {
                              "logs_collected": {
                                "files": {
                                  "collect_list": [
                                    {
                                      "file_path": "c:\\ProgramData\\Amazon\\AmazonCloudWatchAgent\\Logs\\amazon-cloudwatch-agent.log",
                                      "log_group_name": "/iaps/amazon-cloudwatch-agent.log",
                                      "log_stream_name": "{hostname}",
                                      "timestamp_format": "%H: %M: %S%y%b%-d"
                                    },
                                    {
                                      "file_path": "c:\\tools\\nginx-*\\logs\\access.log",
                                      "log_group_name": "/iaps/access.log",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "file_path": "c:\\tools\\nginx-*\\logs\\error.log",
                                      "log_group_name": "/iaps/error.log",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "file_path": "C:\\Program Files (x86)\\I2N\\IapsNDeliusInterface\\Log\\XMLTRANSFER.LOG",
                                      "log_group_name": "/iaps/ndinterface/xmltransfer.log",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "file_path": "C:\\Program Files (x86)\\I2N\\IapsNDeliusInterface\\Log\\DAILY\\DAYSUMMARY.LOG",
                                      "log_group_name": "/iaps/ndinterface/daysummary.log",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "file_path": "C:\\Program Files (x86)\\I2N\\IapsIMInterface\\Log\\IMIAPSIF.LOG",
                                      "log_group_name": "/iaps/iminterface/imiapsif.log",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "file_path": "c:\\Setup\\BackupLogs\\backup.log",
                                      "log_group_name": "/iaps/backup.log",
                                      "log_stream_name": "{hostname}"
                                    }  
                                  ]
                                },
                                "windows_events": {
                                  "collect_list": [
                                    {
                                      "event_format": "xml",
                                      "event_levels": [
                                        "WARNING",
                                        "ERROR",
                                        "CRITICAL"
                                      ],
                                      "event_name": "System",
                                      "log_group_name": "/iaps/system-events",
                                      "log_stream_name": "{hostname}"
                                    },
                                    {
                                      "event_format": "xml",
                                      "event_levels": [
                                        "WARNING",
                                        "ERROR",
                                        "CRITICAL"
                                      ],
                                      "event_name": "Application",
                                      "log_group_name": "/iaps/application-events",
                                      "log_stream_name": "{hostname}"
                                    }
                                  ]
                                }
                              }
                            },
                            "metrics": {
                              "append_dimensions": {
                                "AutoScalingGroupName": "${aws:AutoScalingGroupName}"
                              },
                              "metrics_collected": {
                                "LogicalDisk": {
                                  "measurement": [
                                    "% Free Space"
                                  ],
                                  "metrics_collection_interval": 60,
                                  "resources": [
                                    "*"
                                  ]
                                },
                                "Memory": {
                                  "measurement": [
                                    "% Committed Bytes In Use"
                                  ],
                                  "metrics_collection_interval": 60
                                },
                                "Paging File": {
                                  "measurement": [
                                    "% Usage"
                                  ],
                                  "metrics_collection_interval": 60,
                                  "resources": [
                                    "*"
                                  ]
                                },
                                "PhysicalDisk": {
                                  "measurement": [
                                    "% Disk Time"
                                  ],
                                  "metrics_collection_interval": 60,
                                  "resources": [
                                    "*"
                                  ]
                                },
                                "Processor": {
                                  "measurement": [
                                    "% User Time",
                                    "% Idle Time",
                                    "% Interrupt Time"
                                  ],
                                  "metrics_collection_interval": 60,
                                  "resources": [
                                    "_Total"
                                  ]
                                },
                                "statsd": {
                                  "metrics_aggregation_interval": 60,
                                  "metrics_collection_interval": 30,
                                  "service_address": ":8125"
                                }
                              }
                            }
                          }
                  - name: SetCloudWatchAgentConfig
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          # Copy config file to same directory as windows service
                          $serviceFilePathInQuotes = (Get-WmiObject -Class Win32_service | where Name -eq AmazonCloudWatchAgent).PathName
                          $serviceFilePath = $serviceFilePathInQuotes -replace '"', '' 
                          $serviceDirectoryPath = split-path -Path $serviceFilePath
                          $configFileName = "cloudwatch.config.json"
                          $configFilePath = join-path -path $serviceDirectoryPath -childPath $configFileName
            
                          copy-item -path (join-path -path "C:\Windows\Temp\aws\cloudwatch\" -childpath $configFileName) -destination $configFilePath -force
            
                          # Ensure cloudwatch agent uses config file              
                          Start-Process powershell.exe -WorkingDirectory $serviceDirectoryPath -Wait -ArgumentList ".\amazon-cloudwatch-agent-ctl.ps1 -a fetch-config -m ec2 -c file:$configFileName"
        EOT
      + date_created = (known after apply)
      + description  = "Configures the cloudwatch agent"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "delius_iaps_configure_cloudwatch_agent"
      + owner        = (known after apply)
      + platform     = "Windows"
      + skip_destroy = false
      + tags         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all     = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + type         = (known after apply)
      + version      = "0.1.1"
    }

  # module.imagebuilder.aws_imagebuilder_component.this["delius_mis_set_system_locale.yml"] will be created
  + resource "aws_imagebuilder_component" "this" {
      + arn          = (known after apply)
      + data         = <<-EOT
            ---
            name: delius_iaps_set_system_locale
            description: Sets locale to values requested by
            schemaVersion: 1.0
            parameters:
              - Version:
                  type: string
                  default: 0.1.1
                  description: Component version
              - Platform:
                  type: string
                  default: "Windows"
                  description: Platform name
            phases:
              - name: build
                steps:
                  - name: CreateLocaleConfigFile
                    action: CreateFile
                    inputs:
                      - path: C:\Windows\Temp\UKRegion.xml
                        content: |
                          <gs:GlobalizationServices xmlns:gs="urn:longhornGlobalizationUnattend">
                          <gs:UserList>
                            <gs:User UserID="Current" CopySettingsToDefaultUserAcct="true" CopySettingsToSystemAcct="true"/>
                          </gs:UserList>
                          <gs:UserLocale>
                            <gs:Locale Name="en-GB" SetAsCurrent="true" ResetAllSettings="true">
                          </gs:UserLocale>
                          <gs:SystemLocale Name="en-GB"/>
                          <gs:LocationPreferences>
                            <gs:GeoID Value="242"/>
                          </gs:LocationPreferences>
                          <gs:MUILanguagePreferences>
                            <gs:MUILanguage Value="en-GB"/>
                            <gs:MUIFallback Value="en-US"/>
                          </gs:MUILanguagePreferences>
                          <gs:InputPreferences>
                            <!--en-GB-->
                            <gs:InputLanguageID Action="add" ID="0809:00000809" Default="true"/>
                          </gs:InputPreferences>
                          </gs:GlobalizationServices>
                        overwrite: false
                  - name: SetGBLocale
                    action: ExecutePowerShell
                    inputs:
                      commands:
                        - |
                          $ErrorActionPreference = "Stop"
                          $VerbosePreference = "Continue"
            
                          # Set Locale, language etc.
                          & $env:SystemRoot\System32\control.exe "intl.cpl,,/f:`"C:\Windows\Temp\UKRegion.xml`""
            
                          # Set languages/culture
                          Set-Culture en-GB
        EOT
      + date_created = (known after apply)
      + description  = "Sets locale to values requested by"
      + encrypted    = (known after apply)
      + id           = (known after apply)
      + kms_key_id   = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
      + name         = "delius_iaps_set_system_locale"
      + owner        = (known after apply)
      + platform     = "Windows"
      + skip_destroy = false
      + tags         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all     = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + type         = (known after apply)
      + version      = "0.1.1"
    }

  # module.imagebuilder.aws_imagebuilder_distribution_configuration.this will be created
  + resource "aws_imagebuilder_distribution_configuration" "this" {
      + arn          = (known after apply)
      + date_created = (known after apply)
      + date_updated = (known after apply)
      + description  = "Delius MIS server"
      + id           = (known after apply)
      + name         = "delius_mis_windows_server"
      + tags         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all     = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }

      + distribution {
          # At least one attribute in this block is (or was) sensitive,
          # so its contents will not be displayed.
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_pipeline.this will be created
  + resource "aws_imagebuilder_image_pipeline" "this" {
      + arn                              = (known after apply)
      + date_created                     = (known after apply)
      + date_last_run                    = (known after apply)
      + date_next_run                    = (known after apply)
      + date_updated                     = (known after apply)
      + description                      = "Delius MIS server"
      + distribution_configuration_arn   = (known after apply)
      + enhanced_image_metadata_enabled  = true
      + id                               = (known after apply)
      + image_recipe_arn                 = (known after apply)
      + infrastructure_configuration_arn = (known after apply)
      + name                             = "delius_mis_windows_server"
      + platform                         = (known after apply)
      + status                           = "ENABLED"
      + tags                             = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all                         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }

      + image_tests_configuration {
          + image_tests_enabled = false
          + timeout_minutes     = 720
        }

      + schedule {
          + pipeline_execution_start_condition = "EXPRESSION_MATCH_ONLY"
          + schedule_expression                = "cron(0 0 2 * ? *)"
          + timezone                           = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_image_recipe.this will be created
  + resource "aws_imagebuilder_image_recipe" "this" {
      + arn              = (known after apply)
      + date_created     = (known after apply)
      + description      = "Delius MIS server"
      + id               = (known after apply)
      + name             = "delius_mis_windows_server"
      + owner            = (known after apply)
      + parent_image     = (sensitive value)
      + platform         = (known after apply)
      + tags             = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all         = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + user_data_base64 = (known after apply)
      + version          = "0.0.1"

      + block_device_mapping {
          + device_name = "/dev/sda1"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + volume_size           = 30
              + volume_type           = "gp3"
            }
        }
      + block_device_mapping {
          + device_name = "/dev/xvdf"

          + ebs {
              + delete_on_termination = "true"
              + encrypted             = "true"
              + kms_key_id            = "arn:aws:kms:eu-west-2:374269020027:key/12984197-3371-4c21-8e43-a88a1581e691"
              + snapshot_id           = "snap-04435aa8246764616"
              + volume_size           = 7
              + volume_type           = "gp3"
            }
        }

      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/amazon-cloudwatch-agent-windows/x.x.x"
        }
      + component {
          + component_arn = "arn:aws:imagebuilder:eu-west-2:aws:component/ec2launch-v2-windows/x.x.x"
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }
      + component {
          + component_arn = (known after apply)
        }
    }

  # module.imagebuilder.aws_imagebuilder_infrastructure_configuration.this will be created
  + resource "aws_imagebuilder_infrastructure_configuration" "this" {
      + arn                           = (known after apply)
      + date_created                  = (known after apply)
      + date_updated                  = (known after apply)
      + description                   = "Delius MIS server"
      + id                            = (known after apply)
      + instance_profile_name         = "ImageBuilder"
      + instance_types                = [
          + "t3.medium",
        ]
      + name                          = "delius_mis_windows_server_0_0_1"
      + resource_tags                 = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + security_group_ids            = [
          + "sg-0ee607811d7668f33",
        ]
      + subnet_id                     = "subnet-014d083e052388b2a"
      + tags                          = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + tags_all                      = {
          + "add_net_framework_features-version"             = "0.2.0"
          + "amazon-cloudwatch-agent-windows-version"        = "1.0.0"
          + "application"                                    = "DELIUS-CORE"
          + "branch"                                         = "main"
          + "business-unit"                                  = "HMPPS"
          + "delius_iaps_configure_cloudwatch_agent-version" = "0.1.1"
          + "delius_iaps_set_system_locale-version"          = "0.1.1"
          + "ec2launch-v2-windows-version"                   = "1.0.0"
          + "image-pipeline"                                 = "delius_mis_windows_server"
          + "image-recipe"                                   = "delius_mis_windows_server/0.0.1"
          + "infrastructure-configuration"                   = "delius_mis_windows_server/0.0.1"
          + "is-production"                                  = "true"
          + "os-version"                                     = "windows server 2022"
          + "owner"                                          = "Probation Webops: probation-webops@digital.justice.gov.uk"
          + "release-or-patch"                               = "patch"
          + "source-code"                                    = "https://github.com/ministryofjustice/modernisation-platform-ami-builds/tree/main/teams/delius-core"
        }
      + terminate_instance_on_failure = true

      + logging {
          + s3_logs {
              + s3_bucket_name = "ec2-image-builder-logs-20211019134837153100000001"
              + s3_key_prefix  = "delius"
            }
        }
    }

Plan: 7 to add, 0 to change, 0 to destroy.

```
